espressif/esp-idf/components/soc/esp32h21/register/soc/pvt_struct.h
/** Type of comb_pd_site0_unit0_vt1_conf1 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_en_vt1_pd_site0_unit0 : R/W; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_en_vt1_pd_site0_unit0:1;
        /** timing_err_cnt_clr_vt1_pd_site0_unit0 : WT; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_clr_vt1_pd_site0_unit0:1;
        /** delay_limit_vt1_pd_site0_unit0 : R/W; bitpos: [9:2]; default: 20;
         *  needs field desc
         */
        uint32_t delay_limit_vt1_pd_site0_unit0:8;
        uint32_t reserved_10:13;
        /** delay_num_o_vt1_pd_site0_unit0 : RO; bitpos: [30:23]; default: 0;
         *  needs field desc
         */
        uint32_t delay_num_o_vt1_pd_site0_unit0:8;
        /** timing_err_vt1_pd_site0_unit0 : RO; bitpos: [31]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_vt1_pd_site0_unit0:1;
    };
    uint32_t val;
} pvt_comb_pd_site0_unit0_vt1_conf1_reg_t;

/** Type of comb_pd_site0_unit1_vt1_conf1 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_en_vt1_pd_site0_unit1 : R/W; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_en_vt1_pd_site0_unit1:1;
        /** timing_err_cnt_clr_vt1_pd_site0_unit1 : WT; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_clr_vt1_pd_site0_unit1:1;
        /** delay_limit_vt1_pd_site0_unit1 : R/W; bitpos: [9:2]; default: 20;
         *  needs field desc
         */
        uint32_t delay_limit_vt1_pd_site0_unit1:8;
        uint32_t reserved_10:13;
        /** delay_num_o_vt1_pd_site0_unit1 : RO; bitpos: [30:23]; default: 0;
         *  needs field desc
         */
        uint32_t delay_num_o_vt1_pd_site0_unit1:8;
        /** timing_err_vt1_pd_site0_unit1 : RO; bitpos: [31]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_vt1_pd_site0_unit1:1;
    };
    uint32_t val;
} pvt_comb_pd_site0_unit1_vt1_conf1_reg_t;

/** Type of comb_pd_site0_unit2_vt1_conf1 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_en_vt1_pd_site0_unit2 : R/W; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_en_vt1_pd_site0_unit2:1;
        /** timing_err_cnt_clr_vt1_pd_site0_unit2 : WT; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_clr_vt1_pd_site0_unit2:1;
        /** delay_limit_vt1_pd_site0_unit2 : R/W; bitpos: [9:2]; default: 20;
         *  needs field desc
         */
        uint32_t delay_limit_vt1_pd_site0_unit2:8;
        uint32_t reserved_10:13;
        /** delay_num_o_vt1_pd_site0_unit2 : RO; bitpos: [30:23]; default: 0;
         *  needs field desc
         */
        uint32_t delay_num_o_vt1_pd_site0_unit2:8;
        /** timing_err_vt1_pd_site0_unit2 : RO; bitpos: [31]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_vt1_pd_site0_unit2:1;
    };
    uint32_t val;
} pvt_comb_pd_site0_unit2_vt1_conf1_reg_t;

/** Type of comb_pd_site0_unit3_vt1_conf1 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_en_vt1_pd_site0_unit3 : R/W; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_en_vt1_pd_site0_unit3:1;
        /** timing_err_cnt_clr_vt1_pd_site0_unit3 : WT; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_clr_vt1_pd_site0_unit3:1;
        /** delay_limit_vt1_pd_site0_unit3 : R/W; bitpos: [9:2]; default: 20;
         *  needs field desc
         */
        uint32_t delay_limit_vt1_pd_site0_unit3:8;
        uint32_t reserved_10:13;
        /** delay_num_o_vt1_pd_site0_unit3 : RO; bitpos: [30:23]; default: 0;
         *  needs field desc
         */
        uint32_t delay_num_o_vt1_pd_site0_unit3:8;
        /** timing_err_vt1_pd_site0_unit3 : RO; bitpos: [31]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_vt1_pd_site0_unit3:1;
    };
    uint32_t val;
} pvt_comb_pd_site0_unit3_vt1_conf1_reg_t;

/** Type of comb_pd_site0_unit0_vt2_conf1 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_en_vt2_pd_site0_unit0 : R/W; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_en_vt2_pd_site0_unit0:1;
        /** timing_err_cnt_clr_vt2_pd_site0_unit0 : WT; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_clr_vt2_pd_site0_unit0:1;
        /** delay_limit_vt2_pd_site0_unit0 : R/W; bitpos: [9:2]; default: 20;
         *  needs field desc
         */
        uint32_t delay_limit_vt2_pd_site0_unit0:8;
        uint32_t reserved_10:13;
        /** delay_num_o_vt2_pd_site0_unit0 : RO; bitpos: [30:23]; default: 0;
         *  needs field desc
         */
        uint32_t delay_num_o_vt2_pd_site0_unit0:8;
        /** timing_err_vt2_pd_site0_unit0 : RO; bitpos: [31]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_vt2_pd_site0_unit0:1;
    };
    uint32_t val;
} pvt_comb_pd_site0_unit0_vt2_conf1_reg_t;

/** Type of comb_pd_site0_unit1_vt2_conf1 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_en_vt2_pd_site0_unit1 : R/W; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_en_vt2_pd_site0_unit1:1;
        /** timing_err_cnt_clr_vt2_pd_site0_unit1 : WT; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_clr_vt2_pd_site0_unit1:1;
        /** delay_limit_vt2_pd_site0_unit1 : R/W; bitpos: [9:2]; default: 20;
         *  needs field desc
         */
        uint32_t delay_limit_vt2_pd_site0_unit1:8;
        uint32_t reserved_10:13;
        /** delay_num_o_vt2_pd_site0_unit1 : RO; bitpos: [30:23]; default: 0;
         *  needs field desc
         */
        uint32_t delay_num_o_vt2_pd_site0_unit1:8;
        /** timing_err_vt2_pd_site0_unit1 : RO; bitpos: [31]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_vt2_pd_site0_unit1:1;
    };
    uint32_t val;
} pvt_comb_pd_site0_unit1_vt2_conf1_reg_t;

/** Type of comb_pd_site0_unit2_vt2_conf1 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_en_vt2_pd_site0_unit2 : R/W; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_en_vt2_pd_site0_unit2:1;
        /** timing_err_cnt_clr_vt2_pd_site0_unit2 : WT; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_clr_vt2_pd_site0_unit2:1;
        /** delay_limit_vt2_pd_site0_unit2 : R/W; bitpos: [9:2]; default: 20;
         *  needs field desc
         */
        uint32_t delay_limit_vt2_pd_site0_unit2:8;
        uint32_t reserved_10:13;
        /** delay_num_o_vt2_pd_site0_unit2 : RO; bitpos: [30:23]; default: 0;
         *  needs field desc
         */
        uint32_t delay_num_o_vt2_pd_site0_unit2:8;
        /** timing_err_vt2_pd_site0_unit2 : RO; bitpos: [31]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_vt2_pd_site0_unit2:1;
    };
    uint32_t val;
} pvt_comb_pd_site0_unit2_vt2_conf1_reg_t;

